outputs/aws/loadbalancer/nginx/10000/ab_metrics1.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.29.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   8.980 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2950000 bytes
HTML transferred:       240000 bytes
Requests per second:    1113.60 [#/sec] (mean)
Time per request:       8.980 [ms] (mean)
Time per request:       0.898 [ms] (mean, across all concurrent requests)
Transfer rate:          320.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       9
Processing:     1    9   3.6      8      88
Waiting:        1    8   3.5      8      88
Total:          1    9   3.6      9      88

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     13
  95%     14
  98%     17
  99%     19
 100%     88 (longest request)